# How to Improve the Safety of Driving in MA

## 1. Problem Definition: 
Analyze the relationship between the frequency,severity of car accidents and some factors like time period, road sections, weather conditions and locations. Understand the patterns of car crashes that were taking place in MA and what we could do to avoid a car crash. In addition, we are working on joining with another covid dataset to find out the influence of covid on car crashes.

## 2. Used Dataset:
* US Accidents (link:https://www.kaggle.com/sobhanmoosavi/us-accidents)
* COVID data(link:https://github.com/open-covid-19/data)

### A. Overview of Carcrash Dataset:
* ID: This is a unique identifier of the accident record.
* Start_Time: Shows start time of the accident in local time zone.
* Start_Lat: Shows latitude in GPS coordinate of the start point.
* Start_Lng: Shows longitude in GPS coordinate of the start point.
* County: Shows the county in address field.
* Zipcode: Shows the zipcode in address field.
* Severity: Shows the severity of the accident, a number between 1 and 4, where 1 indicates the least impact on traffic and 4 indicates largest.
* Weather_Condition: Shows the weather condition (rain, snow, thunderstorm, fog, etc.)
* Crossing: A POI annotation which indicates presence of crossing in a nearby location.
* Turning_Loop: A POI annotation which indicates presence of turning_loop in a nearby location.  
(And some similar coloums:Give_Way,Junction,No_Exit,Railway,Roundabout,Station,Stop,Traffic_Calming,Traffic_Signal)

In [57]:
%%bigquery
SELECT * FROM `ba775-b2-team6.team6.US_Accidents` limit 3

Query complete after 0.00s: 100%|██████████| 2/2 [00:00<00:00, 1065.76query/s]
Downloading: 100%|██████████| 3/3 [00:01<00:00,  2.51rows/s]

,ID,Severity,Start_Time,End_Time,Start_Lat,Start_Lng,End_Lat,End_Lng,Distance_mi_,Description,...,Roundabout,Station,Stop,Traffic_Calming,Traffic_Signal,Turning_Loop,Sunrise_Sunset,Civil_Twilight,Nautical_Twilight,Astronomical_Twilight
0,A-38249,2,2016-09-01 09:14:56+00:00,2016-09-01 15:14:56+00:00,41.03674,-73.67549,41.08345,-73.6653,3.271,Between CT-120A/King St/Exit 27 and Round Hill...,...,False,False,False,False,False,False,nan,nan,nan,nan
1,A-1251601,2,2017-10-09 15:46:08+00:00,2017-10-09 21:46:08+00:00,41.03674,-73.67549,41.08345,-73.6653,3.271,Between CT-120A/King St/Exit 27 and Round Hill...,...,False,False,False,False,False,False,nan,nan,nan,nan
2,A-1506619,2,2016-09-16 07:21:23+00:00,2016-09-16 13:21:23+00:00,41.03674,-73.67549,41.08345,-73.6653,3.271,Between CT-120A/King St/Exit 27 and Round Hill...,...,False,False,False,False,False,False,nan,nan,nan,nan

### B. Overview of COVID Dataset:
* Date: Date when the Covid-19 reported.
* New_confirmed: Count of new cases confirmed after positive test on this date
* Cumulative_confirmed: Cumulative sum of cases confirmed after positive test to date
* public_transport_closing: Public transport is not operational
* stay_at_home_requirements: Self-quarantine at home is mandated for everyone
* stringency_index: Overall stringency index

In [61]:
%%bigquery
SELECT * FROM `bigquery-public-data.covid19_open_data.covid19_open_data` LIMIT 3

Query complete after 0.01s: 100%|██████████| 2/2 [00:00<00:00, 351.18query/s]
Downloading: 100%|██████████| 3/3 [00:01<00:00,  2.04rows/s]

,location_key,date,place_id,wikidata_id,datacommons_id,country_code,country_name,iso_3166_1_alpha_2,iso_3166_1_alpha_3,aggregation_level,...,cumulative_vaccine_doses_administered_pfizer,new_persons_fully_vaccinated_moderna,cumulative_persons_fully_vaccinated_moderna,new_vaccine_doses_administered_moderna,cumulative_vaccine_doses_administered_moderna,new_persons_fully_vaccinated_janssen,cumulative_persons_fully_vaccinated_janssen,new_vaccine_doses_administered_janssen,cumulative_vaccine_doses_administered_janssen,location_geometry
0,ES_CT,2021-04-21,ChIJ8_UwhdxbpBIRUMijIeD6AAE,Q5705,nuts/ES51,ES,Spain,ES,ESP,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,POINT(1.47 41.81)
1,ES_CT,2020-10-03,ChIJ8_UwhdxbpBIRUMijIeD6AAE,Q5705,nuts/ES51,ES,Spain,ES,ESP,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,POINT(1.47 41.81)
2,ES_CT,2021-04-26,ChIJ8_UwhdxbpBIRUMijIeD6AAE,Q5705,nuts/ES51,ES,Spain,ES,ESP,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,POINT(1.47 41.81)

### C. Overview of Total Car Crashes between 2016 and 2020 in MA. 
This is the annual total car crashs in each year. And we noticed that 2020 has a relatively high number of car accidents may be because of covid_19. And 2016 has a relatively low number of car accidents may be because of the lost of data.

In [66]:
%%bigquery
SELECT Distinct EXTRACT(year from Start_Time)as year,
COUNT(*)AS annual_car_accidents
FROM `ba775-b2-team6.team6.US_Accidents`
WHERE State='MA'
GROUP BY year
ORDER BY year

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 2227.46query/s]
Downloading: 100%|██████████| 5/5 [00:01<00:00,  3.59rows/s]

   year  annual_car_accidents
0  2016                  3006
1  2017                  5005
2  2018                  5192
3  2019                  4988
4  2020                  6930

This is the number of car crashes happened in each day of week. And we realized that the number of car crashes increased exaggeratedly in Saturday and Sunday in 2020.

In [68]:
%%bigquery
SELECT
EXTRACT(year from Start_Time)as Year,
SUM(CASE WHEN EXTRACT (DAYOFWEEK FROM Start_Time)=2 THEN 1 END)Monday,
SUM(CASE WHEN EXTRACT (DAYOFWEEK FROM Start_Time)=3 THEN 1 END)Tuesday,
SUM(CASE WHEN EXTRACT (DAYOFWEEK FROM Start_Time)=4 THEN 1 END)Wednesday,
SUM(CASE WHEN EXTRACT (DAYOFWEEK FROM Start_Time)=5 THEN 1 END)Thursday,
SUM(CASE WHEN EXTRACT (DAYOFWEEK FROM Start_Time)=6 THEN 1 END)Friday,
SUM(CASE WHEN EXTRACT (DAYOFWEEK FROM Start_Time)=7 THEN 1 END)Saturday,
SUM(CASE WHEN EXTRACT (DAYOFWEEK FROM Start_Time)=1 THEN 1 END)Sunday,
FROM `ba775-b2-team6.team6.carcrash_MA`
GROUP BY year
ORDER BY year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1421.48query/s]
Downloading: 100%|██████████| 5/5 [00:01<00:00,  4.48rows/s]

   Year  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
0  2016     484      637        651       558     538        72      66
1  2017     821     1006       1038      1018     995        52      75
2  2018     886     1045       1082      1014     977        91      97
3  2019     971     1091       1014       947     793        80      92
4  2020    1193     1131       1161      1354    1325       427     339

## 3. Questions and Answers

### A. Q: Which City Has the Largest Number of Car Crashes in 2020?
### &emsp; A: There are 290 different cities in MA and the top five cities are listed below.

In [74]:
%%bigquery
SELECT Count(*)AS Carcrash_Number,City
FROM `ba775-b2-team6.team6.carcrash_MA`
WHERE EXTRACT(year FROM Start_Time)=2020
GROUP BY City
ORDER BY Carcrash_Number DESC
LIMIT 5

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1420.03query/s]
Downloading: 100%|██████████| 5/5 [00:01<00:00,  3.07rows/s]

   Carcrash_Number        City
0              655      Boston
1              349  Dorchester
2              165      Quincy
3              163     Andover
4              136   Braintree

### B. Q: Which Street Has the Largest Number of Car Crashes in 2020?
### &emsp; A: There are 2878 different streets in MA and the top five streets are listed below. It is also clear from the name of the street that most of the crashes occur on the highway.

In [75]:
%%bigquery
SELECT Count(*)AS Carcrash_Number,Street
FROM `ba775-b2-team6.team6.carcrash_MA`
WHERE EXTRACT(year FROM Start_Time)=2020
GROUP BY Street
ORDER BY Carcrash_Number DESC
LIMIT 5

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1511.46query/s]
Downloading: 100%|██████████| 5/5 [00:01<00:00,  4.74rows/s]

   Carcrash_Number   Street
0              459   I-93 N
1              428   I-93 S
2              298   I-95 S
3              266   I-95 N
4              244  I-495 S

### E. Q: How Covid Influences the Number of Car Crashes?
### &emsp; A: I

In [73]:
%%bigquery
SELECT b.m_name AS month,a.monthly_carcrash_number_2020,a.monthly_carcrash_number_average,ROUND(((a.monthly_carcrash_number_2020-a.monthly_carcrash_number_average)/a.monthly_carcrash_number_average)*100,2) AS increase_percentage,b.new_confirmed
FROM( 
SELECT EXTRACT(month FROM Start_Time) month,
SUM(CASE WHEN EXTRACT(year FROM Start_Time)=2020 THEN 1 END)monthly_carcrash_number_2020,
CAST(SUM(CASE WHEN EXTRACT(year FROM Start_Time)BETWEEN 2017 and 2019 THEN 1 END)/3 AS INT64) monthly_carcrash_number_average
FROM `ba775-b2-team6.team6.carcrash_MA`
GROUP BY month)a
INNER JOIN
(SELECT FORMAT_DATE('%B', date) AS m_name,
EXTRACT(month FROM date)AS month,
sum(new_confirmed)AS new_confirmed 
FROM `ba775-b2-team6.team6.covid_open_data_MA` 
WHERE EXTRACT(year from date)=2020 
GROUP BY month,m_name)b
USING(month)
ORDER BY a.month

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 895.26query/s]
Downloading: 100%|██████████| 12/12 [00:01<00:00,  9.85rows/s]

,month,monthly_carcrash_number_2020,monthly_carcrash_number_average,increase_percentage,new_confirmed
0,January,454,512,-11.33,0
1,February,445,481,-7.48,0
2,March,643,400,60.75,6620
3,April,999,329,203.65,55585
4,May,842,384,119.27,34760
5,June,843,374,125.40,11917
6,July,340,329,3.34,8730
7,August,357,411,-13.14,10921
8,September,417,413,0.97,3583
9,October,506,519,-2.50,26460
10,November,560,485,15.46,67556
11,December,524,425,23.29,149046

### Q: Which Road Section has the most serious car accidents?
### &emsp; A:

In [76]:
%%bigquery
SELECT
AVG(CASE WHEN Amenity=True THEN Severity END)Amenity,
AVG(CASE WHEN Bump=True THEN Severity END)Bump,
AVG(CASE WHEN Crossing=True THEN Severity END)Crossing,
AVG(CASE WHEN Give_Way=True THEN Severity END)Give_Way,
AVG(CASE WHEN Junction=True THEN Severity END)Junction,
AVG(CASE WHEN No_Exit=True THEN Severity END)No_Exit,
AVG(CASE WHEN Railway=True THEN Severity END)Railway,
AVG(CASE WHEN Station=True THEN Severity END)Station,
AVG(CASE WHEN Stop=True THEN Severity END)Stop,
AVG(CASE WHEN Traffic_Calming=True THEN Severity END)Traffic_Calming,
AVG(CASE WHEN Traffic_Signal=True THEN Severity END)Traffic_Signal
FROM `ba775-b2-team6.team6.carcrash_MA`

Query complete after 0.00s: 100%|██████████| 2/2 [00:00<00:00, 598.93query/s]
Downloading: 100%|██████████| 1/1 [00:01<00:00,  1.08s/rows]

,Amenity,Bump,Crossing,Give_Way,Junction,No_Exit,Railway,Station,Stop,Traffic_Calming,Traffic_Signal
0,2.122166,2.0,2.16553,2.347826,2.458319,2.0,2.22069,2.114001,2.05,2.0,2.189474

In [77]:
%%bigquery
SELECT EXTRACT(year FROM Start_Time)Year,
SUM(CASE WHEN Amenity=True THEN 1 END)Amenity,
SUM(CASE WHEN Bump=True THEN 1 END)Bump,
SUM(CASE WHEN Crossing=True THEN 1 END)Crossing,
SUM(CASE WHEN Give_Way=True THEN 1 END)Give_Way,
SUM(CASE WHEN Junction=True THEN 1 END)Junction,
SUM(CASE WHEN No_Exit=True THEN 1 END)No_Exit,
SUM(CASE WHEN Railway=True THEN 1 END)Railway,
SUM(CASE WHEN Station=True THEN 1 END)Station,
SUM(CASE WHEN Stop=True THEN 1 END)Stop,
SUM(CASE WHEN Traffic_Calming=True THEN 1 END)Traffic_Calming,
SUM(CASE WHEN Traffic_Signal=True THEN 1 END)Traffic_Signal
FROM `ba775-b2-team6.team6.carcrash_MA`
GROUP BY Year
ORDER BY Year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1094.55query/s]
Downloading: 100%|██████████| 5/5 [00:02<00:00,  2.38rows/s]

,Year,Amenity,Bump,Crossing,Give_Way,Junction,No_Exit,Railway,Station,Stop,Traffic_Calming,Traffic_Signal
0,2016,117,1.0,307,3,407,4.0,45,235,28,1.0,434
1,2017,129,1.0,407,6,582,NaN,51,315,37,1.0,640
2,2018,115,1.0,383,5,622,1.0,46,274,43,1.0,571
3,2019,205,NaN,493,10,510,2.0,59,396,46,NaN,619
4,2020,228,NaN,609,22,866,1.0,89,587,46,1.0,966